CurrencyConvertorClient/bin/Debug/SoapTrace.txt

-----SoapRequest at 3/8/2017 8:08:19 PM
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConversionRate xmlns="http://www.webserviceX.NET/"><FromCurrency>JOD</FromCurrency><ToCurrency>ILS</ToCurrency></ConversionRate></soap:Body></soap:Envelope>
-----SoapResponse at 3/8/2017 8:08:20 PM
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConversionRateResponse xmlns="http://www.webserviceX.NET/"><ConversionRateResult>5.2148</ConversionRateResult></ConversionRateResponse></soap:Body></soap:Envelope>

-----SoapRequest at 3/8/2017 8:15:20 PM
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConversionRate xmlns="http://bzu.cloud:8080/CurrencyConv/services/"><FromCurrency>JOD</FromCurrency><ToCurrency>ILS</ToCurrency></ConversionRate></soap:Body></soap:Envelope>
-----SoapRequest at 3/10/2017 8:58:19 PM
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><parameters xmlns="http://bzu.cloud:8080/ExProj/services/"><FromCurrency xmlns="">USD</FromCurrency><ToCurrency xmlns="">ILS</ToCurrency></parameters></soap:Body></soap:Envelope>
-----SoapResponse at 3/10/2017 8:58:20 PM
<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><rate xmlns="http://bzu.cloud:8080/ExProj/services/">3.6853</rate></soapenv:Body></soapenv:Envelope>

